#+title: Evaluación de la exposición
#+author: Gunnar Wolf

* Ecualización de un histograma en imágenes

- Tema presentado por :: Sebastián emiliano Gayosso Rosillo y Erandy Estefanya
  Pérez Delgado
- Calificación global :: Por favor revisen el resto de este archivo para ver de
  dónde vienen todos estos números 😉

|------------------------+------+--------------------+------+---------|
| Evaluación  compañeros | Peso | Evaluación docente | Peso | *Total* |
|------------------------+------+--------------------+------+---------|
|                    9.4 |  0.3 |               8.63 |  0.7 |    8.86 |
|------------------------+------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Evaluación grupal

|              | 1 | 2 | 3 | 4 | 5 | Total |
|--------------+---+---+---+---+---+-------|
| Originalidad | 0 | 0 | 0 | 2 | 4 |  9.33 |
| Nivel        | 0 | 0 | 0 | 2 | 4 |  9.33 |
| Relevancia   | 0 | 0 | 1 | 1 | 4 |  9.00 |
| Claridad     | 0 | 0 | 0 | 2 | 4 |  9.33 |
| Presencia    | 0 | 0 | 0 | 0 | 6 | 10.00 |
|--------------+---+---+---+---+---+-------|
|              |   |   |   |   |   |  9.40 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6); f-2::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compañeros

Ningún comentario.

* Evaluación por parte del docente

| *Aspecto*              | *Peso* | *Evaluación* | *Puntos* |
|------------------------+--------+--------------+----------|
| Originalidad del tema  |    0.1 |           10 |       1. |
| Material desarrollado  |    0.2 |           10 |       2. |
| Contenido              |    0.2 |          7.5 |      1.5 |
| Fuentes bibliográficas |    0.1 |           10 |       1. |
| Uso del tiempo         |    0.1 |            5 |      0.5 |
| Dominio del tema       |   0.15 |           10 |      1.5 |
| Presencia              |   0.15 |          7.5 |    1.125 |
|------------------------+--------+--------------+----------|
| *Global*               |        |              |     8.63 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios

- El tema da para un excelente desarrollo técnico... pero su exposición se quedó
  en el hablar /acerca de/, y no mostró ni ejemplos de código (para ilustrar el
  uso de OpenMP) ni detalles del algoritmo; presentan las fórmulas para calcular
  el CDF y la nueva intensidad de cada pixel, pero sería esperable que lo
  presentaran mínimamente en forma de pseudocódigo.
- Si bien los histogramas, las imágenes “antes/después” y las curvas del CDF son
  muy claras, presentan varios datos en forma gráfica sin detenerse a explicar
  lo mínimo necesario. Por ejemplo:
  - Lámina 9 (“Comparación de Velocidades”): ¿Qué grado de paralelismo (cuántos
    núcleos) están empleando? Sin ese dato, no tiene sentido comparar
    /Secuencial/ con /Paralelo/ (¿de cuántos?)

    Además, al emplear gráficas de barras con /escala truncada/ (donde el origen
    no es 0), la gráfica queda muy tramposa: Parecería que la versión paralela
    dura como ⅓ de la secuencial, pero la ganancia es de apenas 5% (0.0305 sobre
    0.032). A mí me parece que esto cae dentro del /ruido estadístico/; para
    poder hacer esta medición, tendrían que trabajar con más archivos o archivos
    más grandes.
  - Lámina 10 (“Eficiencia del Paralelismo”), ¿a qué corresponden las etiquetas
    “Eficiencia” y “Speedup”? (¿y por qué una en español y la otra en inglés?
    ¡queda mal! Usen el mismo idioma en una lámina. /Speedup/ puede traducirse
    por /Ganancia/)

    Si la eficiencia es su /línea base/ (que tiene sentido, si es de 1.00), no
    se mide en segundos sino que llanamente en /unidades/, relativo a la
    base. Y, claro, esta gráfica tendría sentido si se presentara el nivel de
    /Ganancia/ obtenido con 2, 3, 4, 5, ... núcleos.
